[
	{
		"id": "4224854",
		"date": "2025-10-03T14:00:00.000Z",
		"body": "I recently was looking for a painter to do some work at my daughter's house. A friend referred me to Niall at NCS Painting. Needed some walls in dining room and front hall with vaulted ceilings painted and laundry room. We were very pleased with the work that was done from start to finish. We would definitely recommend Niall to anyone who is looking and will be using him in the future. Thanks again Karen & Tina",
		"name": "Karen",
		"location": "Edmonton",
		"job": "Interior House Painting",
		"rating": 10,
		"responseDate": "2025-10-18T20:35:25.000Z",
		"response": "Thanks Karen It was a pleasure working for you. Hopefully we can do business in the future."
	},
	{
		"id": "4122654",
		"date": "2025-08-11T11:18:45.000Z",
		"body": "Niall was such a breath of fresh air to work with. We just did a renovation in our house and dealing with all sorts of contractors, Niall was the most professional with the fairest prices. His 35 years of painting experience showed at every point. He insisted that we were absolutely happy with the results and has a 3 year warranty to back it up. His work is exemplary and efficient. His prices are reasonable, his timeline was the fastest of the three quotes we got,.and he delivered quality workmanship on time. We will be hiring him again to do our second renovation.",
		"name": "Shanta Meeder",
		"location": "Edmonton",
		"job": "Interior House Painting",
		"rating": 10,
		"responseDate": "2025-08-27T22:05:22.000Z",
		"response": "Thank you so much Shanta and Wayne for the very nice review. It was a pleasure working for you both. I really hope to see you in the new year."
	},
	{
		"id": "4224877",
		"date": "2025-09-16T06:00:00.000Z",
		"body": "Very happy with not only the work & price, but also with how responsive and flexible NCS was. We hit issues with weather and Niall was easy to work with in regard to schedule. He also gave great advice and information on his recommendations, and I'd be comfortable proposing NCS to other home owners.",
		"name": "Niel",
		"location": "Sherwood Park",
		"job": "Small staining or painting project: Staining; Deck",
		"rating": 10,
		"responseDate": "2025-09-18T06:00:00.000Z",
		"response": "Thanks Neil. I so glad you are happy."
	},
	{
		"id": "7816108",
		"date": "2025-09-22T06:00:00.000Z",
		"body": "Niall did a great job. Quote was very reasonable, he showed up on time and finished the job in good time. Painting was very well done, he kept a tidy job site and cleaned up everything at the end of the job.",
		"job": "Exterior painting: Detached house",
		"name": "Bruce Penny",
		"location": "Edmonton",
		"rating": 10,
		"response": null,
		"responseDate": null
	},
	{
		"id": "1044877",
		"date": "2022-06-17T19:16:40+00:00",
		"body": "We received quotes from 3 companies and met with 2 of them. Niall was super easy to work with (no big sales talk, no stress at all). He just looked at the deck to assess what was needed, gave a brief accounting of the work he'd do (sanding, preparation, matching paint colour and 2 coats of paint), gave dates when he could schedule the work (perfectly within our requested time frame), said he could finish in 1-1/2 to 2 days, and gave a very reasonable quote. All within about 10-15 minutes. Then, he came and did the job perfectly and exactly as he said he would, with absolutely complete clean-up after. So excellent, it looks great! We couldn't be happier! It was such a pleasure to work with Niall. We would certainly work with him again and recommend him for any paint job.",
		"job": "Paint a Backyard Deck",
		"name": null,
		"rating": 10,
		"responseDate": "2022-06-20T06:00:00.000Z",
		"response": "Thanks for the review. It was a pleasure to work with you.",
		"location": null
	},
	{
		"id": "970537",
		"date": "2021-08-08T22:56:35+00:00",
		"body": "I hired Niall, of NCS Painting & Design, to paint my condo. Niall did a beautiful job despite challenges he encountered, and left the place all cleaned up. The job came in precisely on budget. I'm very pleased. ",
		"job": "Condo painting",
		"name": "Dawn Ritz",
		"rating": 10,
		"responseDate": "2021-08-10T06:00:00.000Z",
		"response": "It was a pleasure working for you",
		"location": "Edmonton"
	},
	{
		"id": "965953",
		"date": "2021-07-22T05:05:43+00:00",
		"body": "Niall at NCS Painting was very quick to respond to my request for a quote. He paid detailed attention to the specifics of the job and had a quote ready the next day. Niall  and Phyllis were prompt and efficient doing the work and were respectful of us and our home. He scouted the city on a Sunday  to find the exact right paint for the job, which was in short supply. The walls are beautiful as a result. We are very happy and recommend Niall, who is a true pro.",
		"job": "Beautiful interior paint job",
		"name": "Gail Knutson",
		"rating": 10,
		"response": "Thanks Gail. It was a pleasure working for you.",
		"location": "Edmonton",
		"responseDate": "2021-07-24T15:35:11+00:00"
	},
	{
		"id": "958254",
		"date": "2021-06-24T19:21:20+00:00",
		"body": "Niall was fabulous to work with.  Niall was considerate, fair, committed and followed through on what he said he would deliver; he did great work.  I would definitely bring Niall back to do more work in the future!",
		"job": "Interior Painting",
		"name": null,
		"rating": 10,
		"response": "Thanks for your business. All the best selling your house. I hope you get big bucks for it. Thanks again",
		"location": "Edmonton SW",
		"responseDate": "2021-06-25T09:12:30+00:00"
	},
	{
		"id": "952224",
		"date": "2021-06-05T02:18:37+00:00",
		"body": "I found this guy through friend's recommendation and I'm glad I went with him. We got few free quotes through other companies and decided to go with NCS. The main reason is his professionalism and expertise in home painting and product used. His pricing is reasonable for the quality of work. We had cheaper painters before but ended up with all sorts of problems. He is very punctual, polite, and respectful to your place. All my furniture were properly protected while he's working. Everything was left tidy and clean after the job was completed. So far, my husband and I love the colours he recommended, and enjoy the refreshing of our home.\r\nI would recommend NCS to anyone who wants their houses done PROPERLY!",
		"job": "Whole house interior",
		"name": null,
		"rating": 10,
		"response": "Thanks for the lovely review. It was a pleasure working with you We look forward working with you in the future.",
		"location": "Edmonton",
		"responseDate": "2021-07-06T16:45:03+00:00"
	},
	{
		"id": "771503",
		"date": "2019-07-09T01:29:08+00:00",
		"body": "I had most of my main floor painted. Niall did prep work, and painted ceiling, walls, and trim. He was punctual, thorough, and asked questions. When it turned out the paint I had purchased wasn't good (it had the coverage of chocolate milk), he showed up early the next day so we could come up with a game plan. I ended up getting another paint, which he picked up from the store. I really appreciated him coming to me with his concern and that this roadblock didn't cause me to take time or energy out of my own work. The painting he did was good, but a few spots needed touchups. I brought up the couple missed spots, and he was happy to come back to make the touchups. Niall has great work ethic and made sure that I got the paint job I was looking for.",
		"job": "Interior house painting",
		"name": "HomeOwner",
		"rating": 10,
		"response": "Thanks for your business. It was a pleasure working with you. Great choice in your colour Your place looks great. Enjoy the rest of your summer.",
		"location": null,
		"responseDate": "2019-07-09T01:29:08+00:00"
	},
	{
		"id": "770481",
		"date": "2019-07-05T03:26:47+00:00",
		"body": "NCS did a great job.  Job was done in a day and everything was cleaned up afterwards.",
		"job": "Exterior Painting",
		"name": "HomeOwner",
		"rating": 10,
		"response": "Thanks for your business and nice review.",
		"location": "St Albert",
		"responseDate": "2019-07-08T16:06:07+00:00"
	},
	{
		"id": "705667",
		"date": "2018-11-07T05:35:16+00:00",
		"body": "Excellent paint job and beautiful flooring done very well.Everything left in clean and furnishings back where they belong.Very pleased and happy with a job well done.\r\nWould hire him again.",
		"job": "Painting living room,bedroom,bathroom. New flooring in living room.",
		"name": "alvars41dorrie",
		"rating": 10,
		"response": "Very good. Glad you are happy.",
		"location": null,
		"responseDate": "2018-11-09T15:15:54+00:00"
	},
	{
		"id": "700109",
		"date": "2018-10-18T18:40:55+00:00",
		"rating": 10,
		"body": "I recently hired NCS Painting & Design to do some painting in my home.  NCS was one of a number of painting contractors that I met with and received quotes from.  The quote from NCS was very close to one other quote that I received.  I eventually decided to hire NCS because the other comparable quote was from a large company.  Wherever possible I will always defer to \"the little guy\" and that is not meant to be derogatory in any way.  My feeling is, that with the big guys you are just a number and they are more concerned about their bottom line that the job. The little guy does it because he cares about his workmanship, the people he is working for and loves what he does.  Once the job was done that is very apparent.  Niall was very careful to protect all the furniture, etc. that was in the rooms where he was working.  He kept to the schedule that was agreed to and was very diligent about keeping the work area as neat as could be.  He is very personable and it was certainly a pleasure to have him in my home. I would not hesitate to recommend him to anyone and would certainly call him for any future painting needs. Thank you Niall for all that you did.  The end result is something you can and should be proud of.   I wish you all the best going forward and will perhaps see you in the spring for some exterior painting needs.  ONCE AGAIN, THANK YOU FOR A FANTASTIC JOB !!",
		"job": "Interior painting",
		"name": "P R Achtem",
		"response": "Thank you for taking the time writing a nice review. Hopefully we will see you in the spring..  thanks for your business. All the best Niall",
		"responseDate": "2018-10-22T18:05:27+00:00",
		"location": null
	},
	{
		"id": "700080",
		"date": "2018-10-18T17:41:59+00:00",
		"rating": 10,
		"body": "Very good workmanship done in a timely manner with reasonable rates.\r\nThank you very much NCS Painting ",
		"job": "Exterior painting and staining",
		"name": "Satisfied Consumer",
		"response": "Thanks for the nice review. I enjoyed working with you and your mother.  ",
		"responseDate": "2018-10-26T17:03:53+00:00",
		"location": null
	},
	{
		"id": "685201",
		"date": "2018-08-23T13:33:48+00:00",
		"rating": 10,
		"body": "Niall did a fantastic job repairing and painting some walls.  It was a smaller job and Niall was great to deal with.   On time and fast communication.",
		"job": "Painting",
		"name": "HomeOwner",
		"response": "Thanks for the nice review. Hopefully we can do business in the near future. Thanks for your business",
		"responseDate": "2018-08-24T15:57:33+00:00",
		"location": null
	},
	{
		"id": "681565",
		"date": "2018-08-10T00:20:53+00:00",
		"rating": 10,
		"body": "Niall is professional, knows what he's doing and doesn't take shortcuts. A very good job! ",
		"job": "Painting outside of home, garage and deck",
		"name": "HomeOwner",
		"response": "Thanks. It was a pleasure working with you both",
		"responseDate": "2018-08-10T23:04:45+00:00",
		"location": null
	},
	{
		"id": "679239",
		"date": "2018-08-01T15:46:38+00:00",
		"rating": 10,
		"body": "Niall did an impeccable job painting in our home! He was friendly, yet professional.  \r\nPunctual, efficient and tidy!  \r\nThis is a business we will definitely be using again!\r\nThanks Niall!",
		"job": "Interior painting",
		"name": "HomeOwner",
		"response": "Thanks Tricia It was a pleasure working with you. I hope to work with you again in the near future. Thanks. ",
		"responseDate": "2018-08-03T01:13:15+00:00",
		"location": null
	},
	{
		"id": "650329",
		"date": "2018-04-25T23:21:56+00:00",
		"rating": 10,
		"body": "NCS were punctual, neat,tidy,courteous and very thoughtful  in their approach to painting our house. We never felt\r\nInconvenienced. Their attention to detail was excellent. They took pride in their work and their workmanship exceeded our expectations. Thank you for making our home beautiful again!\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
		"job": "Painting of entire house",
		"name": "HomeOwner",
		"response": "Thanks Oliver for the great review   It was always a pleasure working with you\nThanks for the work ",
		"responseDate": "2018-04-26T16:55:04+00:00",
		"location": null
	},
	{
		"id": "647713",
		"date": "2018-04-16T19:19:28+00:00",
		"rating": 10,
		"body": "Niall and his team member were very professional, quick and did a great job. I would suggest them to anyone and be happy to hire them in future if they return to ontario ",
		"job": "Painted main floor, stairs and hallway upstairs",
		"name": "HomeOwner",
		"response": "Thanks Jemma. Enjoyed working with you and your family. ",
		"responseDate": "2018-04-17T16:32:52+00:00",
		"location": null
	},
	{
		"id": "647109",
		"date": "2018-04-14T01:22:43+00:00",
		"rating": 10,
		"body": " We were very happy with the finished result and cleanliness of the company. We live in an older home that had many renos done and from the get go Niall and his crew were pleasant, clean, professional and on time. We would pass their name to any of our friends and family",
		"job": "NCS Painting painted the new addition on our home.",
		"name": "Victoria Hare",
		"response": "Thank Vic. It was great working with you.  ",
		"responseDate": "2018-04-17T00:35:36+00:00",
		"location": null
	},
	{
		"id": "646898",
		"date": "2018-04-13T14:50:47+00:00",
		"rating": 10,
		"body": "NCS did a wonderful job. We are very satisfied with the whole process from consultation to a well completed paint job.  We are very happy with the color that NCS helped select and the results reflected quality efforts and special attention to details when it comes to trimming work and paint consistency. We were also particularly impressed with the personal touch that NCS exhibited when dealing with us:  pleasant, respectful, and easy to work with.  The bonus is that the company provides a fair price for the work.  We will definitely use NCS again!\r\n\r\n",
		"job": "We recruited the services of NCS Painting ",
		"name": "HomeOwner",
		"response": "Thanks for the nice review. Always a pleasure to work with wonderful people. ",
		"responseDate": "2018-04-16T16:52:40+00:00",
		"location": null
	},
	{
		"id": "646863",
		"date": "2018-04-13T13:16:25+00:00",
		"rating": 10,
		"body": "We used Niall to paint our basement and stain the deck. We were very happy with his work but more of a bonus was he showed up on time and did the work he said he would do.  I would have no problem recommending Niall to friends and family.\r\n",
		"job": "Basement",
		"name": "HomeOwner",
		"response": "Thanks for the nice review. I look forward working with you too in the near future",
		"responseDate": "2018-04-16T16:53:34+00:00",
		"location": null
	},
	{
		"id": "438989",
		"date": "2016-02-20T00:09:53+00:00",
		"rating": 10,
		"body": "We hired NCS Painting (Niall) to repaint our rental units and we couldn't have chosen better. It's so refreshing that customer service, integrity and workmanship are not a thing of the past. ",
		"job": "Interior Painting",
		"name": "HomeOwner",
		"response": "Thanks Hedi.  Have a great weekend",
		"responseDate": "2016-02-20T18:42:02+00:00",
		"location": null
	},
	{
		"id": "389214",
		"date": "2015-08-06T15:11:01+00:00",
		"rating": 10,
		"body": "After receiving quotes for siding replacement, or painting of the existing siding, we made the decision to choose NCS Painting to paint the exterior of our home and detached garage. \r\nNiall was quick to drop by and look over the job scope. He emailed us a detailed quotation that we felt was very reasonable. \r\nHe worked quickly, and efficiently, with minimal interruptions to our home and property. \r\nNiall chooses to use high quality paint products, and that choice is reflected in the quality of his work. Our home looks fabulous! \r\nWe are very pleased with the quality, professionalism, and overall experience of NCS Painting. \r\nWe would definitely recommend them to everyone. ",
		"job": "Exterior residential painting",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "365283",
		"date": "2015-05-07T19:48:13+00:00",
		"rating": 10,
		"body": "Niall recently painted kitchen and hallways of my boyfriend's home.  He was on time and did the job in no time at all!  He even made a few suggestions of where to paint out some of the woodwork to blend in with the walls.  Excellent idea!   Honest and Reliable.  Highly Recommend!  ",
		"job": "Interior Painting",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "365200",
		"date": "2015-05-07T16:06:06+00:00",
		"rating": 10,
		"body": "I got Niall's name from Homestars. He came over took a look at our \r\nhome which is a 50's bungalow. He made some excellent recommendations on what paint to buy and colour selection to help our wee house look brighter and bigger. \r\n\r\nI appreciated the fact that he showed up on time and did the job he said he would do. His work was professional and he left the place clean and tidy.\r\n\r\n",
		"job": "Interior Painting",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "364604",
		"date": "2015-05-05T17:51:09+00:00",
		"rating": 10,
		"body": "Naill did an excellent job in finishing our entryway staircase. It wasnt an easy job but Naill ensured that the job was done the way we wanted it. Thanks Naill!",
		"job": "Refurbished Staircase",
		"name": "HomeOwner",
		"response": "Thanks for the review. It was a pleasure working with you both.",
		"responseDate": "2015-05-07T14:15:29+00:00",
		"location": null
	},
	{
		"id": "304031",
		"date": "2014-09-08T16:41:17+00:00",
		"rating": 10,
		"body": "Niall did a great job painting the exterior of our home. His expert and careful approach were much appreciated. We love the new look!!! Thanks, Niall we highly recommend your services to others!",
		"job": "House exterior painting",
		"name": "HomeOwner",
		"response": "Thanks Howard. The house looks great. I enjoyed working you and your family. ",
		"responseDate": "2014-09-09T04:43:40+00:00",
		"location": null
	},
	{
		"id": "130725",
		"date": "2012-04-17T21:27:18+00:00",
		"rating": 10,
		"body": "If you want your home painted inside or out Niall and Luke are the ones you should hire. They are pleasant, professional, tidy, punctual and most importantly they do  a \"Fabulous\" job. There is a lot of attention to detail that makes a big difference to the end result.\nOur neighbours have noticed and are asking for their number already.\nMy husband and I did not think our old house would look good again.\nThat is what you get from such good quality in painters who take pride in their work. ",
		"job": "Exterior house painting",
		"name": "HomeOwner",
		"response": "Thanks Elly. It was a pleasure to work for you both. And we can't forget about your dogs. Thanks again for your business. Niall",
		"responseDate": "2012-04-18T21:27:15+00:00",
		"location": null
	},
	{
		"id": "129253",
		"date": "2012-04-05T16:21:27+00:00",
		"rating": 10,
		"body": "Niall is professional, courteous and efficient.  His quote was significantly less than competitors for the same scope of work. We have no qualms recommending him for ANY painting job.  Thanks, Niall.  It's like we have a new house!",
		"job": "Interior painting of 2 floors",
		"name": "HomeOwner",
		"response": "Thanks for the nice review. I hope you enjoy your new house. ",
		"responseDate": "2012-04-06T20:36:46+00:00",
		"location": null
	},
	{
		"id": "110889",
		"date": "2011-12-07T00:06:36+00:00",
		"rating": 10,
		"body": "I was extremely happy with all aspects of the work.  The advice and guidance related to which colours suited the different areas was great, and the quality of the final product absolutely superb.\nThroughout the entire job the crew was professional, friendly and left no mess.\nI have no hesitation recommending NCS to any homeowner.",
		"job": "Interior house painting",
		"name": "Chris Buckley",
		"response": "Thanks Chris Merry Xmas and Happy New Year",
		"responseDate": "2011-12-07T17:22:02+00:00",
		"location": null
	},
	{
		"id": "105798",
		"date": "2011-11-16T00:50:47+00:00",
		"rating": 10,
		"body": "Nial was referred to me by another painting company.  We had worked together, I believe on another few jobs but indirectly.  Nial treated my client with respect and professionalism.  My clients were very pleased with the work provided by Nial's company.  I would highly recommend him and his company in the future.\n\nThank you Nial for helping me complete this job.\n\nAnnie Caya\nOwner of Home Designs Staging Group Inc.",
		"job": "Paint touch ups in Toronto Condo",
		"name": "Annie Caya",
		"response": "Thanks Annie. I wish you and your business all the success in the up coming year. Thanks again Niall Smith NCS Painting & Design\r\n",
		"responseDate": "2011-11-16T16:34:28+00:00",
		"location": null
	},
	{
		"id": "105772",
		"date": "2011-11-15T21:37:15+00:00",
		"rating": 10,
		"body": "I am  a General contractor and have hired Nail many times to do the painting at our job sites. I really like using them because of the attention to detail the provide. I have used a lot of painters and Nail and his crew are a pleasure to work with. Thanks Nail!",
		"job": "Home building",
		"name": "Jay McDonald",
		"response": "Thanks Jay I look forward working with you and your crew in the near future. ",
		"responseDate": "2011-11-15T22:44:52+00:00",
		"location": null
	},
	{
		"id": "105591",
		"date": "2011-11-14T18:43:03+00:00",
		"rating": 10,
		"body": "Pleasant, on time and  very professional would recommend them to other buildings in the area. Worked very well with a least amount of supervision. Very friendly and polite with our staff and the members of the building.",
		"job": "painting of unit doors",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "100727",
		"date": "2011-10-03T16:35:29+00:00",
		"rating": 10,
		"body": "We had the exterior of our brick house painted. Niall and his crew did a great job! They covered and protected the surrounding area and cleaned up everyday. They were meticulous in applying the paint and did two coats. We also had some carpentry work/trim that needed to be done, and they were able to do that as well. They went beyond our expectations. We would highly recommend to friends and family for the great work, competitive pricing, and good service. Thanks again Niall!",
		"job": "Exterior paint",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "100183",
		"date": "2011-09-29T14:18:58+00:00",
		"rating": 10,
		"body": "Thanks for doing a timely , outstanding paint job, on  my new beach apartment. Much appreciated , and thanks for being so easy to work with. I would highly recommend Nial and Luke with out hesitation, you will be very satisfied.",
		"job": "Painting ",
		"name": "HomeOwner",
		"response": "Thanks Stuart. I hope you enjoy your new place. ",
		"responseDate": "2011-09-29T16:51:14+00:00",
		"location": null
	},
	{
		"id": "94665",
		"date": "2011-08-22T02:28:27+00:00",
		"rating": 10,
		"body": "Niall came to us on a recommendation.  His work has far exceeded my expectations.  Not only is Niall talented at painting and design, he is also organized, professional and just one of the nicest people you'll ever meet.  He has a calm about him that flows through his team and the work they do.  I have even asked him to come back to my current home to record colours used in a faux finish so he can redo it in my next home!  Niall and team fixed all the rough patches left by drywallers who worked on our reno and smoothed the tension of whose responsibility it was to prep walls: painter or drywaller. He made reno life easier for us.  His price is reasonable especially when considering the talent!  I highly recommend Niall, his work and his team.  Anytime he has done work for us, it has been completed on time. THANK YOU NIall!We had to go through a few \"toad\" painters before you came along.",
		"job": "Faux painting bedroom/kitchen/repair drywall/canvas panel board",
		"name": "HomeOwner",
		"response": "Thanks  Sandra I look forward painting your new place.\r\n",
		"responseDate": "2011-08-22T16:53:10+00:00",
		"location": null
	},
	{
		"id": "94640",
		"date": "2011-08-21T20:33:30+00:00",
		"rating": 10,
		"body": "NCS painted the majority of the interior walls of our house and we were very happy.  Excellent work, professional service, and a competitive price. They are talented and committed.  We were lucky to find them.",
		"job": "Interior Painting",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "94341",
		"date": "2011-08-19T01:20:33+00:00",
		"rating": 10,
		"body": "When we saw what a fantastic job Niall and his team did for a neighbour, we decided to get our house painted. We're thrilled with the results.\n\nNiall's hallmarks are: attention to detail, tidiness, and courtesy (he arrived when he said he would and gave an accurate, reasonable estimate). He is easygoing to work with and had good advice about colour selection.\n\nTo my surprise, Niall can do more than \"just\" paint. He and his team removed the old lathe and plaster from one bedroom wall and installed insulation and new drywall before painting it. Extra bonus: no mess!\n\nLooking forward to having Niall back to take care of the rest of the house.",
		"job": "House painting",
		"name": "HomeOwner",
		"response": "Thanks a lot. I look forward with working with you soon. \r\n",
		"responseDate": "2011-08-19T15:49:36+00:00",
		"location": null
	},
	{
		"id": "93839",
		"date": "2011-08-15T01:13:59+00:00",
		"rating": 10,
		"body": "Niall was recommended to us by our neighbour.  He and his helper where always punctual, pleasant, professional and always left the house as clean as they found it (if not cleaner)!  Would not hesitate to recommend him to my firends. ",
		"job": "New staircase staining",
		"name": "HomeOwner",
		"response": "Thanks Marc. Enjoy your new staircase Thanks for tour business",
		"responseDate": "2011-08-15T17:41:31+00:00",
		"location": null
	},
	{
		"id": "85744",
		"date": "2011-05-28T16:48:07+00:00",
		"rating": 10,
		"body": "I recently had the entire interior of my house painted by NCS Painting and Design.  I could not be more pleased with the entire process and the finished result.  Niall and his crew were a pleasure to deal with - constantly friendly, reliable, clean, thorough and professional.  I live in an older home so my walls and baseboards required considerable prep work.  The completed job was incredible, definitely exceeded my expectations.  Niall was also very helpful with suggestions concerning colour and design which I truly appreciated and fortunately, I followed his advice.   I would highly recommend NCS Painting and Design.  My thanks to Niall and his crew for their wonderful work!",
		"job": "Painted interior of my house",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "85634",
		"date": "2011-05-27T03:17:28+00:00",
		"rating": 10,
		"body": "I found Niall on homestars, he had some great reviews and I liked the pictures of his work, I think we share the same style sensibility.  I left him a message and he returned my call right away, we made an appointment and he showed up on time as I appreciate starting out on the right foot.  Niall showed me some more photos of other projects and I liked the ideas he suggested for our back room as we had some challenges tying it into the rest of our home.  \n\nHis rates were good, but more importantly I felt like I was getting good value for money and I can say with confidence that Niall really has a talent for painting and design.  I was happy with his work but, my wife was ecstatic with the finished product.  Happy wife, happy husband.  They left our house clean as a whistle, I am going to use him for our upcoming basement reno.\n\nI highly recommend Niall especially if you're having some challenges picking out colors or trying to compliment one room to another.",
		"job": "Painting & Finishing our back room",
		"name": "Chris Anderson",
		"response": "Thanks Chris!!!!!!",
		"responseDate": "2011-05-27T20:58:32+00:00",
		"location": null
	},
	{
		"id": "83824",
		"date": "2011-05-08T19:34:11+00:00",
		"rating": 10,
		"body": "I was impressed by Niall and his company from the very beginning. He answered my E-Mail request immediately. Niall is very professional and offered some very helpful suggestions. He is also very pleasant to deal with.\n\n Niall and his team arrived on time and the workmanship was remarkable. The job entailed many drywall repairs and painting in two upstairs bedrooms. Both bedrooms have vaulted ceilings, so the repairs and painting were challenging.\n\n NCS Painting also did plaster and drywall repairs and painting in the hallway, living room and kitchen. The house is an older home in the upper beach and some areas of the walls required a lot of extra material and work.\n\n The total cost was less than I had expected, considering the extensive preparation of the walls and ceilings.\n\n  Niall and his team did an extraordinary job and I am so happy with the results\n\n  Susan      ",
		"job": "painting and drywall repairs",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "81404",
		"date": "2011-04-12T02:33:43+00:00",
		"rating": 10,
		"body": "This is the first time we have used a professional painting service and found the complete experience wonderful. The full team was professional & courtesy at all times and the attention to every detail was so professional. The faux stone finish is wonderful and admired by everyone who visits our business.\n\nNext time we need a painting service we will call NCS painting and recommend them to our friends. High recommended!",
		"job": "Faux painting in great room & hall",
		"name": "stephen spenceley",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "71653",
		"date": "2011-01-06T23:20:49+00:00",
		"rating": 10,
		"body": "We purchased a 100 year old home in the Beaches that had not been painted in a long,long  time. Niall and his team not only painted it very well they spent days patching and prepping the old walls and plaster so that the finished product would be very good. We were very pleased with their attention to detail and professionalism. We would highly recommend them to others.",
		"job": "Repainted entire interior of house",
		"name": "HomeOwner",
		"response": "Thanks for the review Peter and Julie. Have a Happy New Year!!",
		"responseDate": "2011-01-07T14:12:47+00:00",
		"location": null
	},
	{
		"id": "71497",
		"date": "2011-01-04T18:25:59+00:00",
		"rating": 10,
		"body": "NCS Painting and Design has worked on many projects with my company over the past two years and will continue to do so due to their high level of professionalism and expertise. As a general contractor I would highly recommend NCS to anyone for their painting and finishing needs.",
		"job": "Interior and Exterior",
		"name": "Jay McDonald",
		"response": "Thanks Jay I look forward working with you and your great crew. Thanks Niall",
		"responseDate": "2011-01-04T23:05:42+00:00",
		"location": null
	},
	{
		"id": "69233",
		"date": "2010-12-06T23:18:42+00:00",
		"rating": 10,
		"body": "Great quality work on very short notice.  As an interior decorator I am a bit of a perfectionist and see everything, and the work I subcontracted to NCS was up to my standards.  I would not hesitate to recommend this company to the most discerning homeowner. ",
		"job": "sub contracted interior painting ",
		"name": "Debbi Callander",
		"response": "Thanks Debbie I look forward with working with you and your company in the near future.",
		"responseDate": "2010-12-10T02:08:40+00:00",
		"location": null
	},
	{
		"id": "67976",
		"date": "2010-11-22T04:55:48+00:00",
		"rating": 10,
		"body": "I hired Niall and his crew to paint some rooms in my apartment. They were done quickly and the quality was excellent. I thought the price was very fair also.",
		"job": "painted my apartment",
		"name": "HomeOwner",
		"response": null,
		"responseDate": null,
		"location": null
	},
	{
		"id": "67753",
		"date": "2010-11-19T04:10:40+00:00",
		"rating": 10,
		"body": "I'm really happy with the painting job - I had to get the outdoor work done, particularly the deck stained before the bad weather.  The crew was fast and efficient and I this reasonable for the amount of work done.  Thanks Niall",
		"job": "painting indoor faux finishes, painting outdoor clapboard and deck",
		"name": "HomeOwner",
		"response": "Thanks Doug. Have good holiday season. ",
		"responseDate": "2010-11-20T04:38:26+00:00",
		"location": null
	},
	{
		"id": "66985",
		"date": "2010-11-09T14:11:21+00:00",
		"rating": 10,
		"body": "We were very happy with the job that NCS did for us as they were very professional and reliable. Niall of NCS listened to our ideas and provided valuable input to help achieve the results that we wanted. I've dealt with many people in the construction and painting business and I am extremely impressed with how professional Niall and his crew were in terms of timelines and getting the job done right.  Most importantly, the quality of work really reflects their expertise and work approach! \n\nThanks so much Niall!! \n\nStacey",
		"job": "interior painting for kitchen, bathroom, bedrooms and living room",
		"name": "HomeOwner",
		"response": "I look forward working for you both in the future. Thanks Niall",
		"responseDate": "2010-11-09T23:44:57+00:00",
		"location": null
	},
	{
		"id": "66697",
		"date": "2010-11-05T14:49:27+00:00",
		"rating": 10,
		"body": "I was away when Niall's company came to paint my soffit and fascia and when I returned there was no evidence of drips or drops of paint anywhere about and the soffit and fascia looked brand new.\n",
		"job": "Painting of soffit and fascia",
		"name": "HomeOwner",
		"response": "Thanks it was a pleasure working for you. ",
		"responseDate": "2010-11-05T17:39:55+00:00",
		"location": null
	},
	{
		"id": "62876",
		"date": "2010-09-20T14:24:05+00:00",
		"rating": 10,
		"body": "We decided to change from brown Sikkens stain to a light grey. The work was completed to our\ncomplete satisfaction. I would recommend this Company. Also painted the interior of my home last year with great results!!!!!!!",
		"job": "Exterior Painting of a 1800 sq ft home & double garage",
		"name": "HomeOwner",
		"response": "Thanks for your review. It was a pleasure working for you both. Thanks Niall Smith NCS Painting & Design",
		"responseDate": "2010-09-20T19:15:34+00:00",
		"location": null
	}
]
